{
    "id": 791373,
    "page": 1,
    "results": [
        {
            "author": "msbreviews",
            "author_details": {
                "name": "",
                "username": "msbreviews",
                "avatar_path": "/https://secure.gravatar.com/avatar/992eef352126a53d7e141bf9e8707576.jpg",
                "rating": 7.0
            },
            "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAfter years of outstanding effort from passionate fans, Warner Bros. finally decided to give Zack Snyder the opportunity to finish his movie on his own terms. 2017's Justice League went through massive production issues - explained in my review of said film - and despite years of extremely tiresome, toxic discourse on social media, the famous Snyder Cut got a controversy-inducing budget to complete an undoubtedly unfinished cut. A crucial disclaimer: you'll see countless reviews based on wholly different approaches. Some people will review it as a standalone, regular movie, while others will look at it as an extended/alternate cut of a film previously released. I'm part of the latter group of reviewers.\r\n\r\nI find it a bit unfair to criticize pacing issues or an overlong runtime when the purpose of this cut is precisely to show everything Snyder had in his hand. Director/Extended/Ultimate Cut, call it what you feel it's appropriate, but it's a four-hour movie, so many scenes will inevitably drag or feel unnecessary and irrelevant. The narrative is fundamentally the same, which means the audience knows what's coming from a general perspective. Still, I'm reviewing this version mostly on its own merits, but without forgetting that it's not a regular theatrical film and that it unquestionably builds upon what was already released.\r\n\r\nWithout getting into spoilers, I do have to write this: the heavy marketing was incredibly misleading, and I don't doubt for a second that many fans will feel disappointed regarding certain story points and particular characters. The whole \"it's a totally distinct movie\" or \"Joss Whedon only used 10% of Snyder's footage\" were nothing more than false publicity for a cut that honestly didn't need it. Out of the 119 minutes of the 2017's version, probably around 80/90 minutes are also in the Snyder Cut, which will be surprising for people who expected something entirely unique. The base of the narrative is identical, most scenes are just extended versions of the original, but there are a couple of significant new changes that ultimately make Zack Snyder's Justice League better than its \"predecessor\".\r\n\r\nThe most impactful modification that drastically changes the emotional core of the film is about Cyborg. Ray Fisher's character goes from barely having any remotely significant screentime in 2017 to being the heart and soul of the movie. From his backstory to the development across the runtime, Cyborg is undoubtedly the superhero that gains the most with this cut, leaving as a complete, compelling character who I genuinely cared for. On the other hand, Aquaman and The Flash receive similar introductory scenes with Batman, barely getting any sort of new individual growth besides more action sequences. However, once the League is assembled, the character interactions increase, improving their team spirit and deeply elevating the \"Us United\" storyline.\r\n\r\nThe humor and tone remain lighter than in other Snyder films, clearly something that the filmmaker always had in mind for his version (Whedon only added a couple of more jokes since most of them are present in this cut). The intimidating runtime does negatively affect the overall pacing, but the longer build-ups and extensive dialogue scenes make the full movie much more cohesive and coherent. Compared to the original's abrupt, awful editing work, the Snyder Cut has a tremendously better flow, giving time for information to sink in and characters to get used to each other. I rather watch an overlong film with a well-built story than the complete contrary. Some color changes and tone adjustments also improve the movie's consistency.\r\n\r\nStory-wise, besides the fantastic arc given to Cyborg, there are a couple of changes that heavily affect either a particular character or a secondary storyline, but when it comes to the main narrative, it's more or less about the same. Every action sequence with pre-existent footage is visually improved and extended with scenes not seen before, but the new VFX are as hit-and-miss as Junkie XL's score. The latter mixes up so many different types of tracks and music that it genuinely becomes a tad confusing. While some scenes get an absolutely perfect, epic soundtrack, others receive weird, out-of-place music distracting the scene itself.\r\n\r\nThere's only one change I definitely dislike: the R rating brings horribly artificial, forced blood splashes and out-of-nowhere cursing that simply don't belong in the film. I know Snyder loves his gritty, bloody, gory action - as do I - but either the whole movie is consistent with this type of action, or some scenes will feel like they come from a wholly separate film. A few bloody sequences work well enough, but most just feel notably forced, while the cursing feels ridiculously out-of-character at points. It's by far the most incompatible aspect of the cut, but admittedly, one that doesn't heavily impact my opinion.\r\n\r\nA common issue I have with extended cuts is that these mostly add and rarely remove. Snyder Cut partially breaks that rule, removing some scenes from the 2017's version, supposedly only Whedon's footage (which some people wrongly believe to be almost the entire movie). While most of the decisions regarding this process are efficient, there's a couple of them that not only don't improve the respective storylines but actually make them less powerful than the theatrical film. For example, in Snyder Cut, the \"bringing Superman back\" arc lacks an important character's take on the situation, having in mind that character's past. It actually feels a bit out-of-character that the viewers don't get to see what that person thinks about a potentially devastating action.\r\n\r\nRegarding Steppenwolf, his design looks better than the terrible original, and his motivations are clearer, but unfortunately, he remains a generic CGI punching bag for our superheroes. His dynamic armor is packed with spikes, but it's really one of those designs with visual impact only since it has no effect whatsoever in battle. I can't get into spoilers about Darkseid or DeSaad, but I can safely write that these characters are nothing more than fan-service, just like Joker (Jared Leto). The ending is definitely the sequence that changes the most due to the addition of dozens of new/extended action scenes, and it does play out differently - though the conclusion is essentially the same - leaving the viewers with a menacing threat on the horizon.\r\n\r\nZack Snyder's Justice League is arguably a more cohesive, consistent, and emotionally compelling movie than the 2017's version. As expected, its four-hour runtime causes pacing issues and possesses dozens of unnecessary, irrelevant scenes, but criticizing these aspects in an admittedly non-theatrical cut is unfairly defeating its purpose. Despite most of the original Justice League being present in the Snyder Cut - something that might surprise a few fans - the main narrative is built and developed through a structure that flows tremendously better than the previous edition. Cyborg becoming the emotional core of the story and the increased character interactions are some of the best changes Zack Snyder and Chris Terrio did. The extended action sequences are more riveting, and pre-existent footage is definitely improved, but the new VFX are as erratic as Junkie XL's all-over-the-place score. The R-rating is the only straight-up negative aspect that damages the film with highly forced, fake-looking blood and rare yet cringe-worthy cursing. Highly anticipated characters and/or storylines are better described as unimpactful fan-service, but overall, most of the decisions made vastly improve upon what was already built. In the end, I sincerely expect a significant majority of the fandom to get their expectations fulfilled, and I hope that the DCEU continues with Snyder involved - just as long as the studios leave filmmakers to do their job without nonsensical restrictions.\r\n\r\nRating: B",
            "created_at": "2021-03-15T16:20:41.130Z",
            "id": "604f89596517d6006a209fa0",
            "updated_at": "2021-03-15T16:20:41.130Z",
            "url": "https://www.themoviedb.org/review/604f89596517d6006a209fa0"
        },
        {
            "author": "JPV852",
            "author_details": {
                "name": "",
                "username": "JPV852",
                "avatar_path": "/xNLOqXXVJf9m7WngUMLIMFsjKgh.jpg",
                "rating": 7.0
            },
            "content": "Definitely an improvement over the Whedon version and as a DC fan, enjoyed plenty of the character moments (and the addition of MM) but the story did feel off even though the film is nearly four hours long, in addition the alternate timeline part at the end felt tacked on and unnecessary. The visual effects looked like something from a video game but I can forgive that since I'd imagine it'd cost an additional $100M to make it look cleaner and more realistic.\r\n\r\nGiven what Snyder had to work with and the fact in reality the studio should've been patient and given him and his family to mourn and re-group later, I am glad this did become a reality, shame that outside of maybe The Flash movie there won't be a follow-up with Darkseid. **3.5/5**",
            "created_at": "2021-03-18T21:16:00.330Z",
            "id": "6053c31042f19f003c9945cd",
            "updated_at": "2021-03-18T21:16:00.330Z",
            "url": "https://www.themoviedb.org/review/6053c31042f19f003c9945cd"
        },
        {
            "author": "sykobanana",
            "author_details": {
                "name": "",
                "username": "sykobanana",
                "avatar_path": "/j2KpvD880J95lqf3ct4u1MmWZhE.jpg",
                "rating": 9.0
            },
            "content": "This is DC's best so far...easily.  \r\nAlthough not flawless- there are a couple of scenes that didnt need to be included - this is the version that we needed to see.  \r\nThere is so much more time given to the characters in this, the plot is better thought out and structured, and Steppenwolf is no longer a joke.  There is actually an urgency in his battles with the JL now.  And OMG, Darkseid and Desaad look and sound boss.  \r\nThe recruitment is harder, the fight between the JL and Supes and then the JL and Steppenwolf is more brutal, and Superman's 'recovery' is better paced and makes more sense. \r\nThis also follows directly on from BVS and links directly into Aquaman. \r\nAnd the closing cover of Hallelujah is glorious (it near comes close to Jeff Buckley's angelic version)\r\n\r\nIt's flaws - Timing of release - I need to watch this in a cinema.  FU WB for not giving Snyder the time to finish this as he envisioned.  THIS is what we should have gotten, not the tripe that was Josstice League.  This movie shows that Snyder was not just trying to catch up to Marvel, he was their own version of their stories and it should have been allowed to come to the end of the cycle.  \r\nAlso, I was underwhelmed by the score and would have loved Zimmer to have returned to complete this.  \r\nAnd there are a couple of initial set-up scenes that could have been let go or shortened and the gapping continuity error scene in the middle where the JL get introduced to Alfred after theyve already met him should have just been left out. \r\n\r\nBut we got what we asked for - the Snyder Cut in its entirety. \r\nAnd I am grateful for that...thankyou.\r\n\r\nNow, could we please create ZSJL2 so we can see the Injustice and Darkseid stories.",
            "created_at": "2021-03-20T05:20:43.261Z",
            "id": "6055862bfd4f800074b8e18f",
            "updated_at": "2021-03-20T05:20:43.261Z",
            "url": "https://www.themoviedb.org/review/6055862bfd4f800074b8e18f"
        },
        {
            "author": "Peter89Spencer",
            "author_details": {
                "name": "",
                "username": "Peter89Spencer",
                "avatar_path": "/https://secure.gravatar.com/avatar/dadb1b759a8516c815cdcc58abcefc85.jpg",
                "rating": 10.0
            },
            "content": "I really, really REALLY wasn't expecting this - it felt like the extended edition of Lord of the Rings, if Zack Snyder directed it!\r\nNo, this was Zack Snyder's vision of Justice which we should've seen, if it wasn't for Joss Whedon hadn't pissed all over it. I mean, I understand why Snyder had to pull out the production, I really do, but Whedon could've had the decency to keep to heart on Snyder's work. Looking back, it was a total disrespect to the visionary director. This film...wow! It was truly and 100% amazed me.\r\n\r\nPlus, my best highlight was the voiceover of of Superman's dads Johnathan and Jor-El reminding him of who is he - it felt poignant.\r\n\r\nThat said, a couple of things I feel I must complain about this, just small things; 1) I noticed Mera had a change of accent. Probably an original idea, but it sounded funny especially soon after 2018 Aquaman was released. 2) Victor Stone's dad Silas sacrificed himself - not only was it upsetting but it changes everything for the future of DCEU films. I guess this means they;ll have to rewrite everything for that Cyborg movie!\r\n\r\nAt least we got the introduction of the Joker (Jared Leto reprising his role) as well as the (not so) surprising twist of the Martian Manhunter!\r\nNot to mention we finally got to see the appearance of Darkseid - it was all like a fusion of 300's Persian empire and LOTR's Sauron!\r\n\r\nIn the end, this was a true masterpiece from Zack Snyder, since Watchmen and Sucker Punch, and I am so pleased - no, grateful this was made. I thank not just the director himself for returning to this project but also the many fans who petitioned this director's cut to happen.\r\nFor once, we finally had something good out of all this chaos that was covid 19, hence why they chose the song Hallelujah for their Snyder cut trailer!\r\n\r\nThank you so much, Zack Snyder - you have always been my fav movie director.\r\nJoss Whedon, you are officially dead to me!",
            "created_at": "2021-03-20T10:36:06.278Z",
            "id": "6055d0169ae613006adfb910",
            "updated_at": "2021-03-20T10:36:06.278Z",
            "url": "https://www.themoviedb.org/review/6055d0169ae613006adfb910"
        },
        {
            "author": "Yassin_Raouf",
            "author_details": {
                "name": "",
                "username": "Yassin_Raouf",
                "avatar_path": null,
                "rating": 10.0
            },
            "content": "10/10 this is absolutely fantastic, just 1 word, #RestoreTheSnyderVerse",
            "created_at": "2021-03-24T16:38:24.885Z",
            "id": "605b6b00d5ffcb005631ed1b",
            "updated_at": "2021-03-25T19:28:23.052Z",
            "url": "https://www.themoviedb.org/review/605b6b00d5ffcb005631ed1b"
        }
    ],
    "total_pages": 1,
    "total_results": 5
}
